# Prompt

**Your assignment involves combining information from a number of SQL tables, 
then displaying the information in a pandas DataFrame. For your relational database management system, you may use any RDBMS, including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by the database in Step 1 below.**

# Step 1

**For your database, you should download and install the appropriate version 
of the Chinook database for your RDBMS, which is available here, under the 
downloads tab: https://chinookdatabase.codeplex.com/**

## Import libraries

In [1]:
# I am selecting to use sqlite to complete this project
import sqlite3
from sqlalchemy import create_engine
import pandas as pd

I created a sqlite database using this script: https://raw.githubusercontent.com/lerocha/chinook-database/master/ChinookDatabase/DataSources/Chinook_Sqlite.sql

In [2]:
# using sqlalchemy, I am accessing the sqlite database 'project3.db' that is stored locally
engine = create_engine('sqlite:////Users/snr13/Google Drive/School/CUNY/IS 362/Projects/project3/project3.db')

# Step 2

**Your task is to create a pandas DataFrame that displays Customers’ Last 
Name and First Name, and each customer’s purchased Track names and 
Album Titles. The information should be sorted by Customer LastName 
then Customer FirstName.**

In [3]:
# the sql command below joins 5 tables and outputs the info required for this assignment
sql = '''SELECT LastName, FirstName, Track.Name, Album.Title
         FROM Customer
         LEFT JOIN Invoice
         ON Customer.CustomerID = Invoice.CustomerId
         LEFT JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         LEFT JOIN Track
         ON InvoiceLine.TrackId = Track.TrackId
         LEFT JOIN Album
         ON Track.AlbumId = Album.AlbumId 
         ORDER BY LastName, FirstName'''

In [4]:
# the pandas method .read_sql reads/queries the db using the sql command
pd.read_sql(sql, engine).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas